color1 = input("Введіть перший основний колір (червоний, зелений або синій): ").lower()
color2 = input("Введіть другий основний колір (червоний, зелений або синій): ").lower()

# Перевіряємо, чи введені кольори є відомими основними кольорами
if color1 not in ["червоний", "зелений", "синій"] or color2 not in ["червоний", "зелений", "синій"]:
    print("Така палітра не відома.")
else:
    # Змішуємо кольори і визначаємо результат
    if (color1 == "червоний" and color2 == "зелений") or (color1 == "зелений" and color2 == "червоний"):
        result = "жовтий"
    elif (color1 == "синій" and color2 == "зелений") or (color1 == "зелений" and color2 == "синій"):
        result = "блакитний"
    elif (color1 == "синій" and color2 == "червоний") or (color1 == "червоний" and color2 == "синій"):
        result = "пурпуровий"
    else:
        result = "невизначений"


    print(f"Після змішування отримуємо колір: {result}")
